Autodesk.Revit.DB.Structure.RebarHandleNameData.SetCustomHandleName(System.String)
Sets the name of the handle.
customHandleName:
The name of the handle.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018

Autodesk.Revit.DB.Structure.RebarHandleNameData.GetCustomHandleTag
Gets the handle tag for which we need to specify the name.
Returns:
Returns the handle tag for which we need to specify the name.
Since:
2018

Autodesk.Revit.DB.Structure.RebarHandleNameData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.RebarHandleNameData
This class is used to contain the information about the rebar handle name defined by an external application.
Since:
2018